<?php

namespace Database\Seeders;

use App\Models\News;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class NewsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        News::updateOrCreate([
            'category_id'       => 1,
            'subcategory_id'    => 1,
            'image'             => 'public/images/20230621072626.jpg',
            'published_date'    => '2023/06/11',
            'title'             => 'বর্তমানে হাজ্জাজ আলীর খামারের মূল্য  ৪ কোটি',
            'description'       => 'আসছে পবিত্র ঈদুল আজহা, প্রতিবছর কোরবানির পশুর হাটে মৌসুমি ব্যবসায়ীদের পছন্দের তালিকায় শীর্ষে থাকে হাজ্জাজ আলীর খামারের গরু ।  এ গরু কেনার পর তাঁরা ঢাকায় নিয়ে বিচিত্র সব নাম দিয়ে বিক্রি করেন। এর অন্যতম কারণ, হাজ্জাজ আলীর খামারের গরু দেখতে যেমন বলবান ও সুন্দর হয়ে থাকে, তেমনি গায়ের রং ও আকারেও আকর্ষণীয়। উন্নতজাতের গরু উৎপাদন, পালন ও বিপণনে রাজধানী ঢাকাসহ দেশজুড়ে ছড়িয়ে রয়েছে তাঁর খ্যাতি।
            ',
            'status'            => 1,
        ]);



        // Sports News
        News::updateOrCreate([
            'category_id'       => 6,
            'subcategory_id'    => 2,
            'image'             => 'public/images/20230621072444.jpg',
            'published_date'    => '2023/06/15',
            'title'             => 'ইতিহাসের তৃতীয় বৃহত্তম টেস্ট জয় বাংলাদেশের',
            'description'       => 'চরম নাটকীয়তার মধ্য দিয়ে শেষ হলো ঢাকা টেস্ট। তাসকিনের বলে উইকেটের পিছনে ক্যাচ ধরলেন লিটন, আম্পায়ারও আউট দিলেন। উল্লাসে মেতে উঠলেন সবাই, রিভিউ নিলেন  ব্যাটার জহির খান।⛑  রিপ্লেতে দেখা গেল ব্যাটে বল লাগেনি। থার্ড আম্পায়ার নট আউট দিলেন।',
            'status'            => 1,
        ]);
        News::updateOrCreate([
            'category_id'       => 6,
            'subcategory_id'    => 2,
            'image'             => 'public/images/20230621072739.jpg',
            'published_date'    => '2023/06/15',
            'title'             => 'শান্ত ডাবল সেঞ্চুরি না পেলেও সন্তুষ্ট',
            'description'       => 'রানটা যখন একশ ছাড়াল তখন থেকেই নাজমুল হোসেন শান্তকে নিয়ে অনেকে ভবিষ্যদ্বাণী করেছেন। শান্তর থেকে ডাবল সেঞ্চুরি দেখতে চান দর্শকরা। সেটি করার পথেই ছিলেন বাঁহাতি এই ব্যাটার। কিন্তু আউট হয়ে গেলেন ১৪৬ রানের মাথায়। ম্যাচ শেষে সংবাদ সম্মেলনে এ নিয়ে অবশ্য কোনো আক্ষেপ নেই বলেই জানালেন প্রথম দিনের সেরা পারফর্মার।⛑
            ',
            'status'            => 1,
        ]);
        News::updateOrCreate([
            'category_id'       => 6,
            'subcategory_id'    => 2,
            'image'             => 'public/images/20230621073534.jpg',
            'published_date'    => '2023/06/15',
            'title'             => 'ভারতকে হারিয়ে বিশ্বসেরা অস্ট্রেলিয়া',
            'description'       => 'বিশ্ব টেস্ট চ্যাম্পিয়নশিপের প্রথম আসরে সাউদাম্পটনে ফাইনাল ম্যাচে নিউজিল্যান্ডের বিপক্ষে হেরে শিরোপা হাতছাড়া হয়েছিল ভারতের। অথচ গোটা মৌসুমেই দারুণ খেলেছিল দলটি।
                                    ভারতীদের ভাগ্য এবারও বদলায়নি। গতকাল ওভালে টেস্ট চ্যাম্পিয়নশিপের  আসরের ফাইনালের শেষ দিনে অস্ট্রেলিয়ার বিপক্ষে আত্মসমর্পন করে ভারত দল ।
                                    ভারতের দরকার ছিল ২৮০ রান, অস্ট্রেলিয়ার ৭ উইকেট। ভারত যোগ করতে পারে ৭০ রান। চতুর্থ ইনিংসে ৪৪৪ রানের বিশাল লক্ষ্য ব্যাট করতে নেমে ২৩৪ রানে অলআউট হয় ভারত। ২০৯ রানের বিশাল জয় নিয়ে প্রথমবারের মতো টেস্ট চ্যাম্পিয়ন হয় অস্ট্রেলিয়া। নিউজিল্যান্ডের পর টেস্টের শ্রেষ্ঠত্বের মুকুট- পেয়ে গেল ক্রিকেট ইতিহাসের সবচেয়ে সফলতম দল।
                                    ',
            'status'            => 1,
        ]);

        // Technology News
        News::updateOrCreate([
            'category_id'       => 2,
            'subcategory_id'    => 2,
            'image'             => 'public/images/20230621084839.jpg',
            'published_date'    => '2023/06/15',
            'title'             => 'পাঁচ বিসিএসের সর্বনিম্ন উত্তীর্ণ - ৪৫তম বিসিএস',
            'description'       => '৪৫তম বিসিএসের প্রিলিমিনারি পরীক্ষার ফল প্রকাশ করেছে বাংলাদেশ সরকারি কর্ম কমিশন (পিএসসি)। এতে উত্তীর্ণ হয়েছেন ১২ হাজার ৭৮৯ জন।

            ',
            'status'            => 1,
        ]);
        News::updateOrCreate([
            'category_id'       => 2,
            'subcategory_id'    => 2,
            'image'             => 'public/images/20230621085518.jpg',
            'published_date'    => '2023/06/15',
            'title'             => 'ভারতে ট্রেন দুর্ঘটনায় নিহত ২৮৮, আহত ৮০০',
            'description'       => 'ভারতের ওডিশা রাজ্যে ভয়াবহ ট্রেন দুর্ঘটনায় নিহত বেড়ে ২৮৮ জনে দাঁড়িয়েছে। আহত হয়েছেন ৮০০ জনের বেশি। ট্রেনের ভেতরে এখনো অনেকে আটকা পড়ে আছেন। নিহতের সংখ্যা আরও বাড়তে পারে বলে আশঙ্কা করা হচ্ছে।
            ',
            'status'            => 1,
        ]);

// Political News
        News::updateOrCreate([
            'category_id'       => 3,
            'subcategory_id'    => 2,
            'image'             => 'public/images/20230621094216.jpg',
            'published_date'    => '2023/06/15',
            'title'             => 'দুদকের মামলায় বিএনপি নেতা আমানউল্লাহ-এর ১৩ বছর টুকুর ৯ বছরের কারাদণ্ড বহাল।',
            'description'       => 'দুর্নীতি মামলায় বিএনপির স্থায়ী কমিটির সদস্য আমানউল্লাহ-এর ১৩ বছর ইকবাল হাসান মাহমুদ টুকুর ৯ বছরের কারাদণ্ড বহাল রেখেছেন হাইকোর্ট।
            নিম্ন আদালতের রায়ের বিরুদ্ধে আপিল শুনানি শেষে আজ মঙ্গলবার (৩০ মে) বিচারপতি মো. নজরুল ইসলাম তালুকদার ও বিচারপতি খিজির হায়াতের হাইকোর্ট বেঞ্চ পৃথক মামলায় এ রায় ঘোষণা করেন। একইসঙ্গে বিচারিক আদালতে তাদের আত্মসমর্পণ করতে বলা হয়েছে।
             ৪ কোটি ৯৬ লাখ ১১ হাজার ৯১৬ টাকার সম্পত্তির হিসাব ও আয়ের উৎস গোপন করার অভিযোগে দুদকের উপ-পরিচালক শাহরিয়ার চৌধুরী ২০০৭ সালের মার্চে সাবেক বিদ্যুৎ প্রতিমন্ত্রী টুকুর বিরুদ্ধে মোহাম্মদপুর থানায় এই মামলা দায়ের করেন। কমিশনের উপ-পরিচালক এসএমএম আখতার হামিদ ভূঞা ওই বছর ২৮ জুন মহানগর হাকিম আদালতে এ মামলায় অভিযোগপত্র দেন।
             হাইকোর্টের ওই রায়ের বিরুদ্ধে দুদক আপিল করলে ২০১৪ সালের ২১ জানুয়ারি খালাসের রায় বাতিল করে পুনঃশুনানির আদেশ দেন আপিল বিভাগ।
            ',
            'status'            => 1,
        ]);
        News::updateOrCreate([
            'category_id'       => 3,
            'subcategory_id'    => 2,
            'image'             => 'public/images/20230621092632.jpg',
            'published_date'    => '2023/06/15',
            'title'             => 'খালেদা জিয়ার আবেদন শুনানির জন্য বেঞ্চ নির্ধারণ করল আদালত।',
            'description'       => 'নাইকো দুর্নীতি মামলার অভিযোগ গঠন বাতিল চেয়ে খালেদা জিয়ার আবেদন শুনানির জন্য হাইকোর্ট বেঞ্চ নির্ধারণ করে দিয়েছেন আদালত।
            ',
            'status'            => 1,
        ]);
// Entertainment News
        News::updateOrCreate([
            'category_id'       => 7,
            'subcategory_id'    => 2,
            'image'             => 'public/images/20230621093810.jpg',
            'published_date'    => '2023/06/15',
            'title'             => 'শাকিব খান। চমকের পর চমক। যেন সব হিসাব বদলে দিচ্ছেন। এই তো ‘প্রিয়তমা’ চলচ্চিত্রে এক লুকেই যেন আটকে ছিলেন।',
            'description'       => 'চমক সৃষ্টি করা বড় চুলের শাকিবকে মিলিয়েছিলেন। দুয়ে-দুয়ে চার মিলিয়ে যখন অপেক্ষা করছিল ভক্তদের একাংশ, তখনই দাবার চাল উল্টে দিয়ে অঙ্কটাকে বদলে দিলেন মঙ্গলবার। অন্তত ভক্তরা এমনটাই বলছেন।
            ',
            'status'            => 1,
        ]);
        News::updateOrCreate([
            'category_id'       => 7,
            'subcategory_id'    => 2,
            'image'             => 'public/images/20230621093810.jpg',
            'published_date'    => '2023/06/14',
            'title'             => 'শাকিব খান। চমকের পর চমক। যেন সব হিসাব বদলে দিচ্ছেন। এই তো ‘প্রিয়তমা’ চলচ্চিত্রে এক লুকেই যেন আটকে ছিলেন।',
            'description'       => 'চমক সৃষ্টি করা বড় চুলের শাকিবকে মিলিয়েছিলেন। দুয়ে-দুয়ে চার মিলিয়ে যখন অপেক্ষা করছিল ভক্তদের একাংশ, তখনই দাবার চাল উল্টে দিয়ে অঙ্কটাকে বদলে দিলেন মঙ্গলবার। অন্তত ভক্তরা এমনটাই বলছেন।
            ',
            'status'            => 1,
        ]);


    }
}
